{
  "welcome": {
    "main_title": "Welcome",
    "about_title": "About me.",
    "about_description": "Hello 👋, my name is Matheus, which means something close to \"Gift given by God\" in Portuguese. Married, father of a little angel, Software Engineer, musician, passionate about teaching and minimalist, and who lives in the city of Manaus - Amazonas, Brazil.",
    "work_title": "Previous work.",
    "link_title_github": "Open project in Github",
    "image_alt_github": "Banner with a white background highlighting the phrase 'www.matheusscode.com' and the description: 'Follow my journey as a Software Engineer and Architect. Explore my personal projects and blog posts.'",
    "congratulations": "I worked on them all with all the affection and gratitude in the world.",
    "ream_table_office": "JR Software Engineer",
    "ham_table_office": "Full Stack Engineer and Systems Analyst",
    "trixx_table_office": "Front End Development Intern",
    "ream_table_period": "01/24 - Today",
    "ham_table_period": "04/23 - 12/2024",
    "trixx_table_period": "07/22 - 03/23",
    "table_head_company": "Company",
    "table_head_period": "Period",
    "table_head_role": "Role"
  },
  "journey": {
    "main_title": "Journey"
  },
  "stack": {
    "main_title": "Stack",
    "group_languages": "Languages",
    "group_front_end": "Front End",
    "group_back_end": "Back End",
    "group_monitoring_and_observability": "Monitoring and Observability",
    "group_database": "Database",
    "group_orm": "ORM",
    "group_cloud": "Cloud",
    "group_devops": "DevOps",
    "group_tools": "Tools",
    "group_package_managers": "Package Managers",
    "javascript": "A widely used programming language for web development, enabling the creation of dynamic and interactive websites.",
    "typescript": "A superset of JavaScript that adds static typing, making error detection and code maintenance easier.",
    "dart": "A programming language optimized for mobile app development with the Flutter framework. (Studying)",
    "python": "A versatile programming language with clear syntax, used for a wide range of applications, from simple scripts to complex systems. (Studying)",
    "rust": "A programming language focused on safety and performance, with modern and efficient syntax. (Studying)",
    "next_js": "A React framework that facilitates building static and dynamic web applications with server-side rendering capabilities.",
    "react_js": "A JavaScript library for building interactive and reusable user interfaces in web applications.",
    "react_native": "A JavaScript-based framework that allows for building native mobile apps using React.",
    "svelte": "A JavaScript framework for building user interfaces with a reactive approach, generating optimized code at compile time.",
    "tailwind_css": "A utility-first CSS framework that allows for creating custom designs with style classes.",
    "material_tailwind": "A CSS framework that combines Material Design principles with Tailwind CSS utilities to create visually appealing interfaces.",
    "styled_components": "A library for styling React components using template literals and CSS-in-JS.",
    "stitches": "A CSS-in-JS library for styling React applications with a focus on performance and flexibility.",
    "ant_design": "A UI component library for React offering a set of components with an elegant and consistent visual style.",
    "shadcn_ui": "A UI component library for React designed for modern applications with an intuitive design.",
    "chakra_ui": "A UI component library for React based on Material Design principles, focusing on accessibility and simplicity.",
    "material_ui": "A UI component library for React promoting accessibility and simplicity, following Material Design guidelines.",
    "radix_ui": "A UI component library for React focusing on high quality and accessibility for modern applications.",
    "node_js": "An asynchronous JavaScript runtime environment based on Google's V8 engine, used for building server-side applications.",
    "nest_js": "A progressive Node.js framework that simplifies building efficient, reliable, and scalable server-side applications.",
    "kita_js": "A minimalist JavaScript framework aimed at building RESTful APIs with simplicity and efficiency.",
    "fastify_js": "A fast and efficient web framework for Node.js, focused on performance and simplicity in building web servers.",
    "express_js": "A minimalist and flexible web framework for Node.js, widely used for building APIs and web applications.",
    "data_dog": "A platform for monitoring and performance analysis of applications, providing insights into logs, metrics, and overall system health.",
    "drizzle": "A modern and intuitive ORM for Node.js and TypeScript, facilitating data manipulation in relational databases.",
    "prisma": "An ORM that simplifies access and manipulation of data in relational and NoSQL databases, with support for TypeScript and JavaScript.",
    "mysql": "A relational database management system developed by Oracle, available under a dual license including both open-source and commercial options.",
    "mongodb": "A NoSQL document-oriented database that stores data in JSON-like format for greater flexibility.",
    "postgresql": "An open-source relational database management system known for its robustness and standards compliance.",
    "firebase": "A mobile and web application development platform offering a range of services, including real-time databases and authentication.",
    "vercel": "A cloud computing platform that simplifies deployment, scaling, and management of web applications and APIs.",
    "railway": "A cloud development platform that streamlines the deployment and management of web applications and databases.",
    "docker": "A platform for creating, distributing, and running applications in containers, ensuring consistency across different development environments.",
    "visual_studio_code": "A source code editor developed by Microsoft, known for its extensions and support for multiple programming languages.",
    "figma": "A browser-based user interface design tool that allows for real-time collaboration.",
    "jira": "Project management and issue tracking software.",
    "discord": "A communication platform for voice, video, and text, aimed at gamers.",
    "insomnia": "A REST client tool for testing APIs and software development.",
    "postman": "A collaboration platform for API development used by developers to build, test, and document APIs.",
    "google_meet": "A video conferencing platform developed by Google.",
    "microsoft_teams": "A collaboration and communication platform developed by Microsoft.",
    "npm": "The standard package manager for the Node.js environment.",
    "yarn": "A fast, reliable, and secure package manager for JavaScript.",
    "pnpm": "A fast and efficient package manager that uses disk space intelligently."
  },
  "workspace": {
    "main_title": "Workspace",
    "table_caption": "For other cool stuff, don&lsquo;t forget to check ",
    "table_head_specs": "Specs",
    "table_head_products": "Products'",
    "product_monitor": "Tilt and height-adjustable stand",
    "product_laptop_support": "Cooled base for notebook with up to 6 height levels.",
    "product_keyboard": "RGB, Mechanical, 3,8x44,5cm.",
    "product_microphone": "Extendable, shock mount, pop filter.",
    "product_mouse": "Customizable with ergonomic and comfortable design.",
    "product_mousepad": "RGB, Extra Large, 800x300mm.",
    "product_laptop": "High-Performance, Full HD, 165Hz.",
    "buy_button": "Buy"
  },
  "projects": {
    "main_title": "Projects",
    "repositories_title": "Repositories",
    "repositories_description": "Check out my GitHub projects and explore the repositories I'm working on.",
    "gist_description": "Check out my custom VSCode settings, optimized for productivity and development with a focus on performance and usability.",
    "repositories_caption": "My repositories ❤️",
    "gist_caption": "My Visual Studio Code Config ❤️",
    "gist_cliboard_success": "Copied to clipboard!",
    "gist_cliboard_error": "Error copying text!",
    "gist_cliboard_label_copy": "Copy",
    "gist_cliboard_label_copied": "Copied!"
  },
  "navigation": {
    "home": "Home",
    "journey": "Journey",
    "stack": "Stack",
    "projects": "Projects",
    "workspace": "Workspace",
    "curriculum": "Curriculum CV",
    "instagram": "Instagram",
    "linkedin": "Linkedin",
    "github": "Github",
    "youtube": "Youtube",
    "threads": "Threads"
  },
  "newsletter": {
    "title": "Do you want to receive my articles and posts by email?",
    "description": "Enter your email below.",
    "placeholder": "Enter your email",
    "label": "Send"
  }
}
