{
  "welcome": {
    "main_title": "Bem-vindo",
    "about_title": "Sobre mim.",
    "about_description": "Olá 👋, meu nome é Matheus, que significa algo próximo a \"Presente dado por Deus\" em português. Casado, pai de um pequeno anjo, Engenheiro de Software, músico, apaixonado por ensinar e minimalista, que mora na cidade de Manaus - Amazonas, Brasil.",
    "work_title": "Trabalhos anteriores.",
    "link_title_github": "Abrir projeto no Github",
    "image_alt_github": "Banner com fundo branco destacando a frase 'www.matheusscode.com' e a descrição: 'Siga minha jornada como Engenheiro de Software e Arquiteto. Explore meus projetos pessoais e postagens no blog.",
    "congratulations": "Trabalhei em todas elas com todo o carinho e gratidão do mundo.",
    "ream_table_office": "Engenheiro de Software Júnior",
    "ham_table_office": "Egenheiro Fullstack e Analista de Sistemas",
    "trixx_table_office": "Estágiario de Desenvolvimento Front End",
    "ream_table_period": "01/24 - Hoje",
    "ham_table_period": "04/23 - 12/2024",
    "trixx_table_period": "07/22 - 03/23",
    "table_head_company": "Empresa",
    "table_head_period": "Periodo",
    "table_head_role": "Cargo"
  },
  "journey": {
    "main_title": "Jornada"
  },
  "stack": {
    "main_title": "Pilha",
    "group_languages": "Linguagens",
    "group_front_end": "Front End",
    "group_back_end": "Back End",
    "group_monitoring_and_observability": "Monitoramento e Observabilidade",
    "group_database": "Banco de Dados",
    "group_orm": "ORM",
    "group_cloud": "Nuvem",
    "group_devops": "DevOps",
    "group_tools": "Ferramentas",
    "group_package_managers": "Gerenciadores de Pacotes",
    "javascript": "Linguagem de programação amplamente utilizada para desenvolvimento web, permitindo criar sites dinâmicos e interativos.",
    "typescript": "Superset de JavaScript que adiciona tipagem estática, facilitando a detecção de erros e a manutenção do código.",
    "dart": "Linguagem de programação otimizada para o desenvolvimento de aplicativos móveis com o framework Flutter. (Estudando)",
    "python": "Linguagem de programação versátil e de fácil leitura, usada para uma ampla gama de aplicações, desde scripts simples a sistemas complexos. (Estudando)",
    "rust": "Linguagem de programação focada em segurança e desempenho, com uma sintaxe moderna e eficiente. (Estudando)",
    "next_js": "Framework para React que facilita a construção de aplicações web estáticas e dinâmicas com funcionalidades de renderização do lado do servidor.",
    "react_js": "Biblioteca JavaScript para construção de interfaces de usuário interativas e reutilizáveis em aplicações web.",
    "react_native": "Framework baseado em JavaScript que permite criar aplicativos móveis nativos utilizando React.",
    "svelte": "Framework JavaScript para construção de interfaces de usuário com uma abordagem reativa, gerando código otimizado em tempo de compilação.",
    "tailwind_css": "Framework CSS baseado em utilitários, que permite a criação de designs customizados com classes de estilo.",
    "material_tailwind": "Framework CSS que combina o design do Material Design com as utilidades do Tailwind CSS para criar interfaces visuais atraentes.",
    "styled_components": "Biblioteca que permite a estilização de componentes React usando literais de template e CSS-in-JS.",
    "stitches": "Biblioteca CSS-in-JS para estilização de aplicações React com foco em desempenho e flexibilidade.",
    "ant_design": "Biblioteca de componentes UI para React que oferece um conjunto de componentes com um estilo visual elegante e consistente.",
    "shadcn_ui": "Biblioteca de componentes UI para React projetada para aplicações modernas com um design intuitivo.",
    "chakra_ui": "Biblioteca de componentes UI para React que se baseia nos princípios do Material Design e foca na acessibilidade e simplicidade.",
    "material_ui": "Biblioteca de componentes UI para React que promove a acessibilidade e simplicidade, seguindo as diretrizes do Material Design.",
    "radix_ui": "Biblioteca de componentes UI para React com foco em alta qualidade e acessibilidade para aplicações modernas.",
    "node_js": "Ambiente de execução JavaScript assíncrono baseado no motor V8 do Google, usado para criar aplicações de servidor.",
    "nest_js": "Framework progressivo para Node.js que facilita a construção de aplicações do lado do servidor de maneira eficiente, confiável e escalável.",
    "kita_js": "Framework minimalista para JavaScript voltado para a construção de APIs RESTful com simplicidade e eficiência.",
    "fastify_js": "Framework web rápido e eficiente para Node.js, focado em desempenho e simplicidade na construção de servidores web.",
    "express_js": "Framework web minimalista e flexível para Node.js, amplamente utilizado para construir APIs e aplicações web.",
    "data_dog": "Plataforma para monitoramento e análise de desempenho de aplicações, fornecendo insights sobre logs, métricas e a saúde geral dos sistemas.",
    "drizzle": "ORM moderno e intuitivo para Node.js e TypeScript, facilitando a manipulação de dados em bancos de dados relacionais.",
    "prisma": "ORM que facilita o acesso e a manipulação de dados em bancos de dados relacionais e NoSQL, com suporte para TypeScript e JavaScript.",
    "mysql": "Sistema de gerenciamento de banco de dados relacional desenvolvido pela Oracle, disponível sob uma licença dual que inclui opções open-source e comerciais.",
    "mongodb": "Banco de dados NoSQL orientado a documentos, que armazena dados em formato JSON-like para maior flexibilidade.",
    "postgresql": "Sistema de gerenciamento de banco de dados relacional de código aberto, conhecido por sua robustez e conformidade com padrões.",
    "firebase": "Plataforma de desenvolvimento de aplicativos móveis e web que oferece uma gama de serviços, como banco de dados em tempo real e autenticação.",
    "vercel": "Plataforma de computação em nuvem que facilita a implantação, escalabilidade e gerenciamento de aplicações web e APIs.",
    "railway": "Plataforma de desenvolvimento em nuvem que simplifica a implantação e o gerenciamento de aplicações web e bancos de dados.",
    "docker": "Plataforma para criar, distribuir e executar aplicações em contêineres, garantindo consistência em diferentes ambientes de desenvolvimento.",
    "visual_studio_code": "Editor de código-fonte desenvolvido pela Microsoft, conhecido por suas extensões e suporte a múltiplas linguagens de programação.",
    "figma": "Ferramenta de design de interfaces de usuário baseada em navegador, permitindo colaboração em tempo real.",
    "jira": "Software de gerenciamento de projetos e rastreamento de problemas.",
    "discord": "Plataforma de comunicação por voz, vídeo e texto voltada para gamers.",
    "insomnia": "Ferramenta cliente REST para testar APIs e desenvolvimento de software.",
    "postman": "Plataforma de colaboração para desenvolvimento de APIs usada por desenvolvedores para construir, testar e documentar APIs.",
    "google_meet": "Plataforma de videoconferência desenvolvida pelo Google.",
    "microsoft_teams": "Plataforma de colaboração e comunicação desenvolvida pela Microsoft.",
    "npm": "Gerenciador de pacotes padrão para o ambiente Node.js.",
    "yarn": "Gerenciador de pacotes rápido, confiável e seguro para JavaScript.",
    "pnpm": "Gerenciador de pacotes rápido e eficiente que utiliza o espaço em disco de forma inteligente."
  },
  "workspace": {
    "main_title": "Espaço de Trabalho",
    "table_caption": "Para outras coisas legais, não se esqueça de conferir ",
    "table_head_specs": "Especificações",
    "table_head_products": "Produtos",
    "product_monitor": "Suporte ajustável em inclinação e altura",
    "product_laptop_support": "Base refrigerada para notebook com até 6 níveis de altura.",
    "product_keyboard": "RGB, Mecânico, 3,8x44,5cm.",
    "product_microphone": "Extensível, com shock mount, filtro pop.",
    "product_mouse": "Personalizável com design ergonômico e confortável.",
    "product_mousepad": "RGB, Extra Grande, 800x300mm.",
    "product_laptop": "Alto desempenho, Full HD, 165Hz.",
    "buy_button": "Comprar"
  },
  "projects": {
    "main_title": "Projetos",
    "repositories_title": "Repositorios",
    "repositories_description": "Confira meus projetos do GitHub e explore os repositórios em que estou trabalhando.",
    "gist_description": "Confira as minhas configurações personalizadas do VSCode, otimizadas para produtividade e desenvolvimento com foco em performance e usabilidade.",
    "repositories_caption": "Meus repositórios ❤️",
    "gist_caption": "Minha configuração do Visual Studi Cocde ❤️"
  },
  "navigation": {
    "home": "Início",
    "journey": "Jornada",
    "stack": "Pilha",
    "projects": "Projetos",
    "workspace": "Espaço de Trabalho",
    "curriculum": "Currículo CV",
    "instagram": "Instagram",
    "linkedin": "Linkedin",
    "github": "Github",
    "youtube": "Youtube",
    "threads": "Threads"
  },
  "newsletter": {
    "title": "Quer receber meus artigos e postagens por e-mail?",
    "description": "Insira seu e-mail abaixo.",
    "placeholder": "Digite seu e-mail",
    "label": "Enviar"
  }
}
