{
  "welcome": {
    "main_title": "Bem-vindo",
    "about_title": "Sobre mim.",
    "about_description": "Olá 👋, meu nome é Matheus, que significa algo próximo a \"Presente dado por Deus\" em português. Casado, pai de um pequeno anjo, Engenheiro de Software, músico, apaixonado por ensinar e minimalista, que mora na cidade de Manaus - Amazonas, Brasil.",
    "work_title": "Trabalhos anteriores.",
    "link_title_github": "Abrir projeto no Github",
    "image_alt_github": "Banner com fundo branco destacando a frase 'www.matheusscode.com' e a descrição: 'Siga minha jornada como Engenheiro de Software e Arquiteto. Explore meus projetos pessoais e postagens no blog.",
    "congratulations": "Trabalhei em todas elas com todo o carinho e gratidão do mundo.",
    "ream_table_office": "Engenheiro de Software Júnior",
    "ham_table_office": "Egenheiro Fullstack e Analista de Sistemas",
    "trixx_table_office": "Estágiario de Desenvolvimento Front End",
    "ream_table_period": "01/24 - Hoje",
    "ham_table_period": "04/23 - 12/2024",
    "trixx_table_period": "07/22 - 03/23"
  },
  "journey": {
    "main_title": "Jornada"
  },
  "stack": {
    "main_title": "Pilha",
    "group_languages": "Linguagens",
    "group_front_end": "Front End",
    "group_back_end": "Back End",
    "group_monitoring_and_observability": "Monitoramento e Observabilidade",
    "group_database": "Banco de Dados",
    "group_orm": "ORM",
    "group_cloud": "Nuvem",
    "group_devops": "DevOps",
    "group_tools": "Ferramentas",
    "group_package_managers": "Gerenciadores de Pacotes",
    "javascript": "Linguagem de programação para desenvolvimento web.",
    "typescript": "Superset de JavaScript com tipagem estática.",
    "dart": "Linguagem otimizada para aplicativos móveis com Flutter. (Estudando)",
    "python": "Linguagem versátil com sintaxe clara. (Estudando)",
    "rust": "Linguagem versátil com sintaxe clara. (Estudando)",
    "next_js": "Framework React para construir aplicações web estáticas e dinâmicas.",
    "react_js": "Biblioteca JavaScript para construção de interfaces de usuário.",
    "react_native": "Framework JavaScript para criar aplicativos móveis nativos usando React.",
    "svelte": "Framework JavaScript para construção de interfaces de usuário com abordagem reativa.",
    "tailwind_css": "Framework CSS com foco em utilidades para construir designs customizados.",
    "material_tailwind": "Framework CSS para construir designs baseados no Material Design usando Tailwind CSS.",
    "styled_components": "Biblioteca para estilizar componentes React usando literais de template.",
    "stitches": "Biblioteca CSS-in-JS para estilizar aplicações React.",
    "ant_design": "Biblioteca de componentes UI React com um estilo visual elegante e consistente.",
    "shadcn_ui": "Biblioteca de componentes UI para React.",
    "chakra_ui": "Biblioteca de componentes UI React baseada no Material Design.",
    "material_ui": "Biblioteca de componentes UI React focada em acessibilidade e simplicidade.",
    "radix_ui": "Biblioteca de componentes UI React de alta qualidade para aplicações modernas.",
    "node_js": "Ambiente de execução JavaScript assíncrono baseado no motor V8 do Google.",
    "nest_js": "Framework progressivo Node.js para construir aplicações do lado do servidor eficientes, confiáveis e escaláveis.",
    "kita_js": "Framework JavaScript minimalista para construção de APIs RESTful.",
    "fastify_js": "Framework web rápido e eficiente para Node.js.",
    "express_js": "Framework web minimalista e flexível para Node.js.",
    "data_dog": "Plataforma para monitoramento, observabilidade e análise que fornece insights abrangentes sobre desempenho de aplicações, logs e métricas.",
    "drizzle": "ORM (Mapeamento Objeto-Relacional) moderno e intuitivo para Node.js e TypeScript.",
    "prisma": "Prisma - Uma coleção de bibliotecas front-end que facilitam o desenvolvimento de dApps gerenciando o estado e as interações com contratos inteligentes.",
    "mysql": "Sistema de gerenciamento de banco de dados relacional de código aberto.",
    "mongodb": "Banco de dados NoSQL orientado a documentos.",
    "postgresql": "Sistema de gerenciamento de banco de dados relacional de código aberto.",
    "oracle_database": "Sistema de gerenciamento de banco de dados relacional desenvolvido pela Oracle.",
    "firebase": "Plataforma para desenvolvimento de aplicativos móveis e web.",
    "vercel": "Plataforma de computação em nuvem que permite aos desenvolvedores implantar, escalar e gerenciar aplicações web e APIs.",
    "railway": "Plataforma de desenvolvimento em nuvem que simplifica a implantação e gerenciamento de aplicações web e bancos de dados.",
    "docker": "Plataforma para desenvolver, enviar e executar aplicações em contêineres.",
    "visual_studio_code": "Editor de código-fonte desenvolvido pela Microsoft.",
    "figma": "Ferramenta de design de interfaces de usuário baseada em navegador.",
    "jira": "Software de gerenciamento de projetos e rastreamento de problemas.",
    "discord": "Plataforma de comunicação por voz, vídeo e texto voltada para gamers.",
    "insomnia": "Ferramenta cliente REST para testar APIs e desenvolvimento de software.",
    "postman": "Plataforma de colaboração para desenvolvimento de APIs usada por desenvolvedores para construir, testar e documentar APIs.",
    "google_meet": "Plataforma de videoconferência desenvolvida pelo Google.",
    "microsoft_teams": "Plataforma de colaboração e comunicação desenvolvida pela Microsoft.",
    "npm": "Gerenciador de pacotes padrão para o ambiente Node.js.",
    "yarn": "Gerenciador de pacotes rápido, confiável e seguro para JavaScript.",
    "pnpm": "Gerenciador de pacotes rápido e eficiente que utiliza o espaço em disco de forma inteligente."
  },
  "workspace": {
    "main_title": "Espaço de Trabalho",
    "table_caption": "Para outras coisas legais, não se esqueça de conferir ",
    "table_head_specs": "Especificações",
    "table_head_products": "Produtos",
    "product_monitor": "Suporte ajustável em inclinação e altura",
    "product_laptop_support": "Base refrigerada para notebook com até 6 níveis de altura.",
    "product_keyboard": "RGB, Mecânico, 3,8x44,5cm.",
    "product_microphone": "Extensível, com shock mount, filtro pop.",
    "product_mouse": "Personalizável com design ergonômico e confortável.",
    "product_mousepad": "RGB, Extra Grande, 800x300mm.",
    "product_laptop": "Alto desempenho, Full HD, 165Hz.",
    "buy_button": "Comprar"
  },
  "navigation": {
    "home": "Início",
    "journey": "Jornada",
    "stack": "Pilha",
    "projects": "Projetos",
    "workspace": "Espaço de Trabalho",
    "curriculum": "Currículo CV",
    "instagram": "Instagram",
    "linkedin": "Linkedin",
    "github": "Github",
    "youtube": "Youtube",
    "threads": "Threads"
  },
  "newsletter": {
    "title": "Quer receber meus artigos e postagens por e-mail?",
    "description": "Insira seu e-mail abaixo.",
    "placeholder": "Digite seu e-mail",
    "label": "Enviar"
  }
}
